Azure 1 Node/load320_logs.txt
java -cp /usr/local/ycsb/ycsb-0.4.0/cassandra-binding/conf:/usr/local/ycsb/ycsb-0.4.0/conf:/usr/local/ycsb/ycsb-0.4.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb/ycsb-0.4.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb/ycsb-0.4.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb/ycsb-0.4.0/lib/core-0.4.0.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/metrics-core-2.0.3.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/netty-3.5.9.Final.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/log4j-1.2.16.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/jetty-util-6.1.22.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/snakeyaml-1.6.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/jackson-mapper-asl-1.9.2.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/snappy-java-1.0.5.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/antlr-runtime-3.2.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/slf4j-log4j12-1.7.2.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/cassandra-all-1.2.9.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/antlr-2.7.7.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/avro-1.4.0-cassandra-1.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/commons-cli-1.1.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/commons-lang-2.6.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/slf4j-api-1.6.4.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/servlet-api-2.5-20081211.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/guava-13.0.1.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/lz4-1.1.0.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/jline-1.0.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/compress-lzf-0.8.4.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/concurrentlinkedhashmap-lru-1.3.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/jetty-6.1.22.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/jamm-0.2.5.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/cassandra-driver-core-1.0.3.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/jbcrypt-0.3m.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/httpcore-4.0.1.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/servlet-api-2.5.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/commons-logging-1.1.1.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/cassandra-thrift-1.2.9.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/snaptree-0.1.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/json-simple-1.1.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/stringtemplate-3.2.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/cassandra-binding-0.4.0.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/jackson-core-asl-1.9.2.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/antlr-3.2.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/commons-codec-1.2.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/httpclient-4.0.1.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/libthrift-0.7.0.jar:/usr/local/ycsb/ycsb-0.4.0/cassandra-binding/lib/high-scale-lib-1.1.2.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.CassandraClient10 -P workloads/workload_test320 -p hosts=100.112.178.81 -threads 320 -p columnfamily=data -s -load
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.CassandraClient10 -P workloads/workload_test320 -p hosts=100.112.178.81 -threads 320 -p columnfamily=data -s -load
Loading workload...
Starting test.
2015-11-12 09:27:31:192 0 sec: 0 operations; est completion in 0 seconds 
2015-11-12 09:27:41:095 10 sec: 3356 operations; 335.6 current ops/sec; est completion in 2 hours 55 minutes [INSERT: Count=3429, Max=9601023, Min=307, Avg=880417.73, 90=256767, 99=9453567, 99.9=9478143, 99.99=9601023] 
2015-11-12 09:27:51:095 20 sec: 89632 operations; 8627.6 current ops/sec; est completion in 12 minutes [INSERT: Count=86203, Max=7479295, Min=195, Avg=36928.11, 90=65727, 99=350207, 99.9=625663, 99.99=838655] 
2015-11-12 09:28:01:095 30 sec: 121885 operations; 3225.3 current ops/sec; est completion in 14 minutes [INSERT: Count=32254, Max=6819839, Min=218, Avg=98519.72, 90=94399, 99=790015, 99.9=6004735, 99.99=6377471] 
2015-11-12 09:28:11:095 40 sec: 161901 operations; 4001.6 current ops/sec; est completion in 13 minutes [INSERT: Count=40015, Max=2977791, Min=203, Avg=55911.36, 90=61855, 99=635903, 99.9=2471935, 99.99=2791423] 
2015-11-12 09:28:21:095 50 sec: 193684 operations; 3178.3 current ops/sec; est completion in 14 minutes [INSERT: Count=31786, Max=12148735, Min=195, Avg=130888.67, 90=57983, 99=9142271, 99.9=11755519, 99.99=11927551] 
2015-11-12 09:28:31:095 60 sec: 235467 operations; 4178.3 current ops/sec; est completion in 14 minutes [INSERT: Count=41780, Max=1145855, Min=249, Avg=39052.4, 90=59679, 99=341759, 99.9=674303, 99.99=1007103] 
2015-11-12 09:28:41:095 70 sec: 292930 operations; 5746.3 current ops/sec; est completion in 12 minutes [INSERT: Count=57463, Max=8888319, Min=230, Avg=82754.97, 90=59007, 99=529407, 99.9=8359935, 99.99=8519679] 
2015-11-12 09:28:51:099 80 sec: 332665 operations; 3971.51 current ops/sec; est completion in 12 minutes [INSERT: Count=39738, Max=6385663, Min=225, Avg=81306.37, 90=68991, 99=562175, 99.9=5861375, 99.99=6115327] 
2015-11-12 09:29:01:095 90 sec: 365246 operations; 3259.73 current ops/sec; est completion in 13 minutes [INSERT: Count=32578, Max=6336511, Min=198, Avg=91296.99, 90=67327, 99=652799, 99.9=5722111, 99.99=5963775] 
2015-11-12 09:29:11:095 100 sec: 429937 operations; 6469.1 current ops/sec; est completion in 12 minutes [INSERT: Count=64691, Max=2052095, Min=180, Avg=43818.2, 90=65119, 99=450559, 99.9=1898495, 99.99=2033663] 
2015-11-12 09:29:21:098 110 sec: 464638 operations; 3468.71 current ops/sec; est completion in 12 minutes [INSERT: Count=34704, Max=8359935, Min=190, Avg=109520.27, 90=64639, 99=678911, 99.9=8085503, 99.99=8249343] 
2015-11-12 09:29:31:095 120 sec: 495452 operations; 3082.63 current ops/sec; est completion in 12 minutes [INSERT: Count=30811, Max=5357567, Min=193, Avg=63008.1, 90=75583, 99=1853439, 99.9=4620287, 99.99=5144575] 
2015-11-12 09:29:41:095 130 sec: 559898 operations; 6444.6 current ops/sec; est completion in 11 minutes [INSERT: Count=64446, Max=5427199, Min=166, Avg=57314.1, 90=58783, 99=477439, 99.9=5046271, 99.99=5390335] 
2015-11-12 09:29:51:095 140 sec: 596457 operations; 3655.53 current ops/sec; est completion in 11 minutes [INSERT: Count=36575, Max=8560639, Min=201, Avg=108344.45, 90=70207, 99=786431, 99.9=8159231, 99.99=8454143] 
2015-11-12 09:30:01:095 150 sec: 641950 operations; 4549.75 current ops/sec; est completion in 11 minutes [INSERT: Count=45489, Max=5455871, Min=201, Avg=69989.37, 90=54207, 99=498175, 99.9=5238783, 99.99=5431295] 
2015-11-12 09:30:11:095 160 sec: 689414 operations; 4746.4 current ops/sec; est completion in 11 minutes [INSERT: Count=47452, Max=1457151, Min=193, Avg=38611.45, 90=56703, 99=447231, 99.9=1084415, 99.99=1301503] 
2015-11-12 09:30:21:095 170 sec: 689414 operations; 0 current ops/sec; est completion in 11 minutes [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2015-11-12 09:30:31:095 180 sec: 736911 operations; 4749.7 current ops/sec; est completion in 11 minutes [INSERT: Count=47497, Max=20119551, Min=197, Avg=162107.01, 90=63775, 99=565247, 99.9=18874367, 99.99=20086783] 
2015-11-12 09:30:41:095 190 sec: 766749 operations; 2983.8 current ops/sec; est completion in 11 minutes [INSERT: Count=29842, Max=7393279, Min=223, Avg=109741.89, 90=66943, 99=6795263, 99.9=6893567, 99.99=6991871] 
2015-11-12 09:30:51:095 200 sec: 819081 operations; 5233.2 current ops/sec; est completion in 11 minutes [INSERT: Count=52328, Max=996863, Min=179, Avg=38879.54, 90=60191, 99=380159, 99.9=673279, 99.99=891391] 
2015-11-12 09:31:01:095 210 sec: 875021 operations; 5594 current ops/sec; est completion in 10 minutes [INSERT: Count=55949, Max=8159231, Min=227, Avg=76840.66, 90=59807, 99=531455, 99.9=7753727, 99.99=7819263] 
2015-11-12 09:31:11:095 220 sec: 885093 operations; 1007.2 current ops/sec; est completion in 11 minutes [INSERT: Count=10063, Max=1018879, Min=199, Avg=38650.26, 90=71487, 99=479487, 99.9=729599, 99.99=978431] 
2015-11-12 09:31:21:095 230 sec: 949797 operations; 6470.4 current ops/sec; est completion in 10 minutes [INSERT: Count=64704, Max=12378111, Min=200, Avg=93472.68, 90=59903, 99=441599, 99.9=11952127, 99.99=12148735] 
2015-11-12 09:31:31:099 240 sec: 984844 operations; 3503.3 current ops/sec; est completion in 10 minutes [INSERT: Count=35057, Max=6918143, Min=215, Avg=91892.48, 90=80959, 99=800255, 99.9=6311935, 99.99=6909951] 
2015-11-12 09:31:41:095 250 sec: 1016298 operations; 3146.66 current ops/sec; est completion in 10 minutes [INSERT: Count=31447, Max=6914047, Min=195, Avg=100727.89, 90=77375, 99=1079295, 99.9=6549503, 99.99=6873087] 
2015-11-12 09:31:51:095 260 sec: 1080303 operations; 6400.5 current ops/sec; est completion in 9 minutes [INSERT: Count=64002, Max=7053311, Min=185, Avg=37044.49, 90=62815, 99=387327, 99.9=656383, 99.99=6541311] 
2015-11-12 09:32:01:095 270 sec: 1088494 operations; 819.1 current ops/sec; est completion in 10 minutes [INSERT: Count=8191, Max=12574719, Min=245, Avg=493955.43, 90=91519, 99=11862015, 99.9=12247039, 99.99=12468223] 
2015-11-12 09:32:11:095 280 sec: 1145123 operations; 5662.9 current ops/sec; est completion in 9 minutes [INSERT: Count=56629, Max=1216511, Min=202, Avg=37877.89, 90=57055, 99=380159, 99.9=773631, 99.99=1038335] 
2015-11-12 09:32:21:094 290 sec: 1170540 operations; 2541.7 current ops/sec; est completion in 9 minutes [INSERT: Count=25420, Max=11108351, Min=207, Avg=167691.05, 90=74431, 99=10584063, 99.9=10731519, 99.99=10780671] 
2015-11-12 09:32:31:095 300 sec: 1209936 operations; 3939.6 current ops/sec; est completion in 9 minutes [INSERT: Count=39393, Max=1284095, Min=244, Avg=38636.01, 90=64159, 99=412671, 99.9=671231, 99.99=976895] 
2015-11-12 09:32:41:095 310 sec: 1242396 operations; 3246 current ops/sec; est completion in 9 minutes [INSERT: Count=32460, Max=8617983, Min=212, Avg=115542.12, 90=68351, 99=912383, 99.9=8130559, 99.99=8331263] 
2015-11-12 09:32:51:095 320 sec: 1293647 operations; 5125.1 current ops/sec; est completion in 9 minutes [INSERT: Count=51260, Max=7991295, Min=182, Avg=84485.33, 90=62687, 99=515839, 99.9=7729151, 99.99=7942143] 
2015-11-12 09:33:01:095 330 sec: 1332443 operations; 3879.6 current ops/sec; est completion in 9 minutes [INSERT: Count=38794, Max=6688767, Min=245, Avg=82761.35, 90=62527, 99=530943, 99.9=5668863, 99.99=5906431] 
2015-11-12 09:33:11:095 340 sec: 1381186 operations; 4874.3 current ops/sec; est completion in 8 minutes [INSERT: Count=48745, Max=4751359, Min=222, Avg=65265.43, 90=76287, 99=553983, 99.9=4259839, 99.99=4472831] 
2015-11-12 09:33:21:095 350 sec: 1432355 operations; 5116.9 current ops/sec; est completion in 8 minutes [INSERT: Count=51160, Max=5455871, Min=178, Avg=63031.57, 90=66239, 99=540159, 99.9=4345855, 99.99=4476927] 
2015-11-12 09:33:31:095 360 sec: 1469098 operations; 3674.3 current ops/sec; est completion in 8 minutes [INSERT: Count=36743, Max=1091583, Min=216, Avg=38818.74, 90=62527, 99=361727, 99.9=695807, 99.99=1008639] 
2015-11-12 09:33:41:095 370 sec: 1533867 operations; 6476.9 current ops/sec; est completion in 8 minutes [INSERT: Count=64769, Max=6279167, Min=198, Avg=64290.48, 90=64191, 99=524799, 99.9=5865471, 99.99=6221823] 
2015-11-12 09:33:51:095 380 sec: 1533867 operations; 0 current ops/sec; est completion in 8 minutes [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2015-11-12 09:34:01:095 390 sec: 1598666 operations; 6479.9 current ops/sec; est completion in 7 minutes [INSERT: Count=64799, Max=13549567, Min=195, Avg=102468.07, 90=72319, 99=429567, 99.9=13254655, 99.99=13426687] 
2015-11-12 09:34:11:097 400 sec: 1620567 operations; 2189.44 current ops/sec; est completion in 7 minutes [INSERT: Count=21901, Max=10035199, Min=240, Avg=171794.48, 90=70207, 99=9248767, 99.9=9478143, 99.99=9740287] 
2015-11-12 09:34:21:095 410 sec: 1663432 operations; 4287.79 current ops/sec; est completion in 7 minutes [INSERT: Count=42865, Max=1459199, Min=192, Avg=38801.77, 90=68607, 99=359679, 99.9=777727, 99.99=1049599] 
2015-11-12 09:34:31:095 420 sec: 1663432 operations; 0 current ops/sec; est completion in 7 minutes [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2015-11-12 09:34:41:094 430 sec: 1723499 operations; 6006.7 current ops/sec; est completion in 7 minutes [INSERT: Count=60067, Max=18071551, Min=210, Avg=131578.84, 90=70399, 99=474111, 99.9=17825791, 99.99=18038783] 
2015-11-12 09:34:51:094 440 sec: 1744382 operations; 2088.3 current ops/sec; est completion in 7 minutes [INSERT: Count=20883, Max=8196095, Min=206, Avg=154735.71, 90=103295, 99=6963199, 99.9=7176191, 99.99=7610367] 
2015-11-12 09:35:01:095 450 sec: 1793006 operations; 4862.4 current ops/sec; est completion in 7 minutes [INSERT: Count=48624, Max=1488895, Min=193, Avg=37077.16, 90=58463, 99=425471, 99.9=801791, 99.99=1029119] 
2015-11-12 09:35:11:121 460 sec: 1849561 operations; 5655.5 current ops/sec; est completion in 7 minutes [INSERT: Count=56555, Max=7970815, Min=193, Avg=81481.17, 90=65791, 99=555007, 99.9=7602175, 99.99=7962623] 
2015-11-12 09:35:21:095 470 sec: 1857747 operations; 818.6 current ops/sec; est completion in 7 minutes [INSERT: Count=8186, Max=917503, Min=184, Avg=33859.88, 90=64895, 99=408063, 99.9=692223, 99.99=862207] 
2015-11-12 09:35:31:095 480 sec: 1922524 operations; 6477.7 current ops/sec; est completion in 6 minutes [INSERT: Count=64777, Max=10280959, Min=179, Avg=85824.45, 90=66751, 99=486399, 99.9=9936895, 99.99=9994239] 
2015-11-12 09:35:41:095 490 sec: 1959079 operations; 3655.5 current ops/sec; est completion in 6 minutes [INSERT: Count=36555, Max=8265727, Min=185, Avg=102662.92, 90=57151, 99=560127, 99.9=7774207, 99.99=7962623] 
2015-11-12 09:35:51:097 500 sec: 1987247 operations; 2815.96 current ops/sec; est completion in 6 minutes [INSERT: Count=28168, Max=1125375, Min=258, Avg=39671.51, 90=60895, 99=498687, 99.9=738303, 99.99=941055] 
2015-11-12 09:36:01:095 510 sec: 2043338 operations; 5610.78 current ops/sec; est completion in 6 minutes [INSERT: Count=56092, Max=10739711, Min=160, Avg=94064.47, 90=65983, 99=528383, 99.9=10297343, 99.99=10551295] 
2015-11-12 09:36:11:094 520 sec: 2051910 operations; 857.2 current ops/sec; est completion in 6 minutes [INSERT: Count=8571, Max=2230271, Min=225, Avg=84508.37, 90=120255, 99=1444863, 99.9=1672191, 99.99=2205695] 
2015-11-12 09:36:21:095 530 sec: 2087585 operations; 3567.5 current ops/sec; est completion in 6 minutes [INSERT: Count=35676, Max=13615103, Min=180, Avg=159171.09, 90=80511, 99=591359, 99.9=13565951, 99.99=13598719] 
2015-11-12 09:36:31:094 540 sec: 2116696 operations; 2911.1 current ops/sec; est completion in 6 minutes [INSERT: Count=29110, Max=1231871, Min=211, Avg=37328.07, 90=54335, 99=382207, 99.9=609279, 99.99=1014271] 
2015-11-12 09:36:41:094 550 sec: 2168773 operations; 5207.7 current ops/sec; est completion in 5 minutes [INSERT: Count=52077, Max=11804671, Min=186, Avg=101809.55, 90=61567, 99=584703, 99.9=10903551, 99.99=11206655] 
2015-11-12 09:36:51:100 560 sec: 2207388 operations; 3861.5 current ops/sec; est completion in 5 minutes [INSERT: Count=38620, Max=6893567, Min=203, Avg=82493.67, 90=60351, 99=915967, 99.9=5869567, 99.99=6365183] 
2015-11-12 09:37:01:095 570 sec: 2247076 operations; 3968.8 current ops/sec; est completion in 5 minutes [INSERT: Count=39683, Max=1392639, Min=244, Avg=37450.95, 90=58879, 99=378623, 99.9=683519, 99.99=977407] 
2015-11-12 09:37:11:095 580 sec: 2292825 operations; 4574.9 current ops/sec; est completion in 5 minutes [INSERT: Count=45749, Max=10805247, Min=209, Avg=107554.54, 90=68159, 99=530943, 99.9=10412031, 99.99=10772479] 
2015-11-12 09:37:21:095 590 sec: 2336036 operations; 4321.1 current ops/sec; est completion in 5 minutes [INSERT: Count=43211, Max=4743167, Min=192, Avg=73093.74, 90=75711, 99=860159, 99.9=4358143, 99.99=4415487] 
2015-11-12 09:37:31:095 600 sec: 2376690 operations; 4065.4 current ops/sec; est completion in 4 minutes [INSERT: Count=40654, Max=1545215, Min=221, Avg=37633.78, 90=60159, 99=487935, 99.9=908799, 99.99=1386495] 
2015-11-12 09:37:41:095 610 sec: 2414627 operations; 3793.7 current ops/sec; est completion in 4 minutes [INSERT: Count=37938, Max=11796479, Min=190, Avg=129922.05, 90=61151, 99=560639, 99.9=11329535, 99.99=11493375] 
2015-11-12 09:37:51:095 620 sec: 2441595 operations; 2696.8 current ops/sec; est completion in 4 minutes [INSERT: Count=26967, Max=1417215, Min=232, Avg=41201.56, 90=55839, 99=535039, 99.9=862719, 99.99=1034751] 
2015-11-12 09:38:01:095 630 sec: 2501145 operations; 5955 current ops/sec; est completion in 4 minutes [INSERT: Count=59550, Max=10321919, Min=200, Avg=88650.37, 90=68159, 99=446975, 99.9=10043391, 99.99=10272767] 
2015-11-12 09:38:11:095 640 sec: 2519843 operations; 1869.8 current ops/sec; est completion in 4 minutes [INSERT: Count=18698, Max=8814591, Min=232, Avg=170352.99, 90=67263, 99=7946239, 99.9=8093695, 99.99=8372223] 
2015-11-12 09:38:21:095 650 sec: 2573860 operations; 5401.7 current ops/sec; est completion in 4 minutes [INSERT: Count=54017, Max=1260543, Min=205, Avg=36523.83, 90=58879, 99=436991, 99.9=731647, 99.99=1056767] 
2015-11-12 09:38:31:096 660 sec: 2573860 operations; 0 current ops/sec; est completion in 4 minutes [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2015-11-12 09:38:41:094 670 sec: 2638646 operations; 6478.6 current ops/sec; est completion in 3 minutes [INSERT: Count=64786, Max=14884863, Min=165, Avg=104970.48, 90=62143, 99=446207, 99.9=14114815, 99.99=14344191] 
2015-11-12 09:38:51:094 680 sec: 2684312 operations; 4566.6 current ops/sec; est completion in 3 minutes [INSERT: Count=45666, Max=8142847, Min=217, Avg=88006.95, 90=60831, 99=497407, 99.9=7741439, 99.99=7958527] 
2015-11-12 09:39:01:094 690 sec: 2703304 operations; 1899.2 current ops/sec; est completion in 3 minutes [INSERT: Count=18992, Max=977407, Min=253, Avg=39019.35, 90=64287, 99=384511, 99.9=665087, 99.99=961023] 
2015-11-12 09:39:11:095 700 sec: 2703304 operations; 0 current ops/sec; est completion in 3 minutes [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2015-11-12 09:39:21:095 710 sec: 2767430 operations; 6412.6 current ops/sec; est completion in 3 minutes [INSERT: Count=64126, Max=20725759, Min=166, Avg=138680.68, 90=66047, 99=485119, 99.9=20348927, 99.99=20578303] 
2015-11-12 09:39:31:095 720 sec: 2795550 operations; 2812 current ops/sec; est completion in 3 minutes [INSERT: Count=28121, Max=7307263, Min=277, Avg=113772.27, 90=72575, 99=6565887, 99.9=6709247, 99.99=6815743] 
2015-11-12 09:39:41:094 730 sec: 2832683 operations; 3713.3 current ops/sec; est completion in 3 minutes [INSERT: Count=37132, Max=1210367, Min=186, Avg=36735.67, 90=60415, 99=385023, 99.9=850943, 99.99=1147903] 
2015-11-12 09:39:51:095 740 sec: 2849748 operations; 1706.5 current ops/sec; est completion in 3 minutes [INSERT: Count=17065, Max=14606335, Min=185, Avg=294449.02, 90=69823, 99=13959167, 99.9=14131199, 99.99=14516223] 
2015-11-12 09:40:01:094 750 sec: 2897447 operations; 4769.9 current ops/sec; est completion in 2 minutes [INSERT: Count=47699, Max=1227775, Min=203, Avg=39183.35, 90=57471, 99=359167, 99.9=668159, 99.99=938495] 
2015-11-12 09:40:11:095 760 sec: 2897447 operations; 0 current ops/sec; est completion in 2 minutes [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2015-11-12 09:40:21:095 770 sec: 2935670 operations; 3822.3 current ops/sec; est completion in 2 minutes [INSERT: Count=38223, Max=21069823, Min=216, Avg=201162.86, 90=59135, 99=653311, 99.9=20250623, 99.99=20512767] 
2015-11-12 09:40:31:095 780 sec: 2962092 operations; 2642.2 current ops/sec; est completion in 2 minutes [INSERT: Count=26422, Max=1131519, Min=265, Avg=41342.9, 90=57055, 99=422143, 99.9=742399, 99.99=828927] 
2015-11-12 09:40:41:095 790 sec: 3025953 operations; 6386.1 current ops/sec; est completion in 2 minutes [INSERT: Count=63861, Max=9215999, Min=232, Avg=81342.91, 90=56959, 99=570367, 99.9=8921087, 99.99=9060351] 
2015-11-12 09:40:51:094 800 sec: 3026910 operations; 95.7 current ops/sec; est completion in 2 minutes [INSERT: Count=957, Max=1768447, Min=11408, Avg=388090.98, 90=1195007, 99=1389567, 99.9=1758207, 99.99=1768447] 
2015-11-12 09:41:01:094 810 sec: 3091651 operations; 6474.1 current ops/sec; est completion in 1 minutes [CLEANUP: Count=2, Max=158, Min=80, Avg=119, 90=158, 99=158, 99.9=158, 99.99=158] [INSERT: Count=64741, Max=12976127, Min=209, Avg=93896.27, 90=73343, 99=455679, 99.9=11329535, 99.99=12771327] 
2015-11-12 09:41:11:094 820 sec: 3113231 operations; 2158 current ops/sec; est completion in 1 minutes [CLEANUP: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [INSERT: Count=21580, Max=8404991, Min=227, Avg=151890.87, 90=91391, 99=7847935, 99.9=8007679, 99.99=8167423] 
2015-11-12 09:41:21:095 830 sec: 3156489 operations; 4325.8 current ops/sec; est completion in 1 minutes [CLEANUP: Count=14, Max=706, Min=33, Avg=98.79, 90=110, 99=706, 99.9=706, 99.99=706] [INSERT: Count=43258, Max=1162239, Min=210, Avg=37191.24, 90=59007, 99=394239, 99.9=680447, 99.99=1065983] 
2015-11-12 09:41:31:095 840 sec: 3198847 operations; 4235.8 current ops/sec; est completion in 1 minutes [CLEANUP: Count=22, Max=6759, Min=27, Avg=569, 90=701, 99=6759, 99.9=6759, 99.99=6759] [INSERT: Count=42358, Max=10387455, Min=233, Avg=104919.07, 90=66303, 99=587263, 99.9=9879551, 99.99=10158079] 
2015-11-12 09:41:41:095 850 sec: 3230422 operations; 3157.5 current ops/sec; est completion in 1 minutes [CLEANUP: Count=31, Max=170, Min=19, Avg=58.45, 90=136, 99=170, 99.9=170, 99.99=170] [INSERT: Count=31575, Max=6987775, Min=204, Avg=82263.33, 90=54239, 99=612863, 99.9=6422527, 99.99=6893567] 
2015-11-12 09:41:51:094 860 sec: 3285981 operations; 5555.9 current ops/sec; est completion in 1 minutes [CLEANUP: Count=39, Max=499, Min=19, Avg=88.87, 90=166, 99=499, 99.9=499, 99.99=499] [INSERT: Count=55559, Max=1023999, Min=165, Avg=26951.34, 90=45855, 99=321279, 99.9=487935, 99.99=690687] 
2015-11-12 09:42:01:094 870 sec: 3334538 operations; 4855.7 current ops/sec; est completion in 55 seconds [CLEANUP: Count=26, Max=522, Min=17, Avg=63.65, 90=78, 99=522, 99.9=522, 99.99=522] [INSERT: Count=48557, Max=8519679, Min=180, Avg=57018.1, 90=43391, 99=274687, 99.9=8011775, 99.99=8282111] 
2015-11-12 09:42:11:095 880 sec: 3373938 operations; 3940 current ops/sec; est completion in 45 seconds [CLEANUP: Count=21, Max=1006, Min=18, Avg=94.1, 90=132, 99=1006, 99.9=1006, 99.99=1006] [INSERT: Count=39402, Max=5722111, Min=171, Avg=45269.22, 90=40831, 99=263679, 99.9=5615615, 99.99=5697535] 
2015-11-12 09:42:21:095 890 sec: 3415427 operations; 4148.9 current ops/sec; est completion in 34 seconds [CLEANUP: Count=12, Max=155, Min=18, Avg=50.75, 90=76, 99=155, 99.9=155, 99.99=155] [INSERT: Count=41487, Max=727039, Min=165, Avg=20116.2, 90=36479, 99=236671, 99.9=406783, 99.99=538623] 
2015-11-12 09:42:31:094 900 sec: 3474268 operations; 5884.1 current ops/sec; est completion in 18 seconds [CLEANUP: Count=24, Max=233, Min=18, Avg=60.92, 90=126, 99=233, 99.9=233, 99.99=233] [INSERT: Count=58841, Max=7942143, Min=171, Avg=36643.61, 90=30943, 99=266495, 99.9=7634943, 99.99=7790591] 
2015-11-12 09:42:41:094 910 sec: 3519864 operations; 4559.6 current ops/sec; est completion in 7 seconds [CLEANUP: Count=62, Max=413, Min=13, Avg=48.13, 90=78, 99=168, 99.9=413, 99.99=413] [INSERT: Count=45596, Max=2863103, Min=183, Avg=23939.63, 90=19279, 99=233471, 99.9=2752511, 99.99=2828287] 
2015-11-12 09:42:51:006 919 sec: 3543348 operations; 2369.25 current ops/sec; [CLEANUP: Count=66, Max=204, Min=14, Avg=44.48, 90=71, 99=161, 99.9=204, 99.99=204] [INSERT: Count=23484, Max=454399, Min=188, Avg=7149.21, 90=9351, 99=202495, 99.9=290815, 99.99=417535] 
[OVERALL], RunTime(ms), 919914.0
[OVERALL], Throughput(ops/sec), 3851.8252793195884
[CLEANUP], Operations, 320.0
[CLEANUP], AverageLatency(us), 97.109375
[CLEANUP], MinLatency(us), 13.0
[CLEANUP], MaxLatency(us), 6759.0
[CLEANUP], 95thPercentileLatency(us), 173.0
[CLEANUP], 99thPercentileLatency(us), 706.0
[INSERT], Operations, 3543348.0
[INSERT], AverageLatency(us), 79331.13708362826
[INSERT], MinLatency(us), 160.0
[INSERT], MaxLatency(us), 2.1069823E7
[INSERT], 95thPercentileLatency(us), 204927.0
[INSERT], 99thPercentileLatency(us), 488447.0
[INSERT], Return=0, 3543348